# user: Polina Kuklina
# date creation: 01.10.2024

# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

# Several solutions. Несколько вариантов решения.
# integer_var = 3
integer_var = int(3)
# float_var = 3.0
float_var = float(3)
# boolean_var = True
boolean_var = bool(3)
# string_var = "3"
string_var = str(3)
none_var = None

print(f" Переменная integer_var имеет тип - {type(integer_var)},\n \
Переменная float_var имеет тип - {type(float_var)},\n \
Переменная boolean_var имеет тип - {type(boolean_var)},\n \
Переменная string_var имеет тип - {type(string_var)},\n \
Переменная none_var имеет тип - {type(none_var)}")
